Enums/ВидыПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алкогольная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обувь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фотоаппараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Духи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Велосипеды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КреслаКоляски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АльтернативныйТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпакованнаяВода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Антисептики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БАДы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НикотиносодержащаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зерно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗерна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоковаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольноеПиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорепродуктыПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияСАТУРН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗерноВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗернаВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МясоПодконтрольноеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетеринарныеПрепараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИгрыИИгрушкиДляДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РадиоэлектроннаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТитановаяМеталлопродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РастительныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптоволокноИОптоволоконнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтопительныеПриборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бакалея</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукцияДо9Процентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефоныИНоутбуки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПиротехническиеИзделияИСредстваПожарнойБезопасности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КабельнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МоторныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольныеНапитки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПивоВПотребительскихУпаковках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническиеСредстваРеабилитации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеИзделия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбщегоНазначенияИСМПКлиентСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоРасширеннаяВерсияГосИС() Экспорт
	
	Возврат ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС();
	
КонецФункции

Функция ДатаНачалаКонтроляКодовМаркировкиМОТП() Экспорт
	
	Возврат '20200701';
	
КонецФункции

// Инициализировать структуру параметров запроса в ИС МОТП (ИС МП) для получения ключа сессии.
// 
// Параметры:
// 	Организация - ОпределяемыйТип.Организация, Неопределено - Организация.
// Возвращаемое значение:
// 	Структура - Параметры запроса ключа сессии См. ИнтерфейсАвторизацииИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии.
//
Функция ПараметрыЗапросаКлючаСессии(Организация = Неопределено) Экспорт
	
	ПараметрыОтправкиHTTPЗапросов = ПараметрыОтправкиHTTPЗапросов("", Истина);
	
	ПараметрыЗапроса = ИнтерфейсАвторизацииИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии();
	ПараметрыЗапроса.Организация = Организация;
	
	ПараметрыЗапроса.ПредставлениеСервиса             = ПараметрыОтправкиHTTPЗапросов.ПредставлениеСервиса;
	ПараметрыЗапроса.Сервер                           = ПараметрыОтправкиHTTPЗапросов.Сервер;
	ПараметрыЗапроса.Порт                             = ПараметрыОтправкиHTTPЗапросов.Порт;
	ПараметрыЗапроса.Таймаут                          = ПараметрыОтправкиHTTPЗапросов.Таймаут;
	ПараметрыЗапроса.ИспользоватьЗащищенноеСоединение = ПараметрыОтправкиHTTPЗапросов.ИспользоватьЗащищенноеСоединение;
	
	ПараметрыЗапроса.ИмяПараметраСеанса                = "ДанныеКлючаСессииИСМП";
	ПараметрыЗапроса.АдресЗапросаПараметровАвторизации = "api/v3/true-api/auth/key";
	ПараметрыЗапроса.АдресЗапросаКлючаСессии           = "api/v3/true-api/auth/simpleSignIn";
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

// Возвращает параметры для отправки HTTP запросов МОТП.
// 
// Параметры:
// 	Поддомен - Строка - Имя поддомена
// 	ИспользоватьTrueAPI - Булево - Использовать true-api
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * ИспользоватьЗащищенноеСоединение - Булево - Признак использования SSL.
// * Таймаут - Число - Таймаут соединения.
// * Порт - Число - Порт соединения.
// * Сервер - Строка - Адрес сервера.
// * ПредставлениеСервиса - Строка - Представления сервиса.
//
Функция ПараметрыОтправкиHTTPЗапросов(Поддомен = "api", ИспользоватьTrueAPI = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(Поддомен) Тогда
		АдресСервера = СтрШаблон("%1.%2", Поддомен, АдресСервера(ИспользоватьTrueAPI));
	Иначе
		АдресСервера = АдресСервера(ИспользоватьTrueAPI);
	КонецЕсли;
	
	ПараметрыОтправкиHTTPЗапросов = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов.Вставить("Сервер",                           АдресСервера);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Порт",                             443);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Таймаут",                          60);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИспользоватьЗащищенноеСоединение", Истина);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ПредставлениеСервиса",             НСтр("ru = 'ГИС МТ'"));
	
	Возврат ПараметрыОтправкиHTTPЗапросов;
	
КонецФункции

// Возвращает адрес сервера ИС МОТП.
// 
// Параметры:
// 	ИспользоватьTrueAPI - Булево - Использовать true-api
// Возвращаемое значение:
// 	Строка - адрес сервера ИС МОТП.
//
Функция АдресСервера(ИспользоватьTrueAPI = Ложь) Экспорт
	
	РежимРаботыСТестовымКонтуромИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.РежимРаботыСТестовымКонтуромИСМП();
	
	Если РежимРаботыСТестовымКонтуромИСМП Тогда
		Возврат "markirovka.sandbox.crptech.ru";
	Иначе
		Возврат "markirovka.crpt.ru";
	КонецЕсли;
	
КонецФункции

Функция ИменаПараметровРаботыКлиента() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить(
		"ВерсияБПОПоддерживаетПроверкуКМЕдинымМетодом",
		"ИнтеграцияИСМП_ВерсияБПОПоддерживаетПроверкуКМСредствамиККТЕдинымМетодом");
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает значение параметра ЗапрашиватьДанныеСервисаИСМП. Если оно установлено как ПоУмолчанию, то значение берется из
//  ФО ЗапрашиватьДанныеСервисаИСМП
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ОтключитьПоВидуПродукцииВидуОперации - Булево - признак необходимости исключения запросов по настройкам исключений контролей
// 
// Возвращаемое значение:
//  Булево - значение ЗапрашиватьДанныеСервисаИСМП
Функция ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, ОтключитьПоВидуПродукцииВидуОперации = Ложь) Экспорт
	
	Значение = Ложь;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыСканирования, "ЗапрашиватьДанныеСервисаИСМП") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП) = Тип("Строка") Тогда
		
		Если ВРег(ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП) = "ПОУМОЛЧАНИЮ" Тогда
			Значение = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЗапрашиватьДанныеСервиса() И Не ОтключитьПоВидуПродукцииВидуОперации;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП) = Тип("Булево") Тогда
		
		Значение = ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Устанавливает значение параметра ЗапрашиватьДанныеСервисаИСМП. 
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  Значение - Булево, Строка - если устанавливается строка "ПоУмолчанию", то значение берется в соответствие с ФО ЗапрашиватьДанныеСервисаИСМП
//    если требуется поведение, отличное от ФО, то оно устанавливается напрямую значением типа Булево
Процедура УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Значение = "ПоУмолчанию") Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыСканирования, "ЗапрашиватьДанныеСервисаИСМП") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП = Значение;
	
КонецПроцедуры

// Возвращает значение параметра ЗапрашиватьДанныеНеизвестныхУпаковокИСМП. Если оно установлено как ПоУмолчанию, то значение берется из
//  ФО ЗапрашиватьДанныеСервисаИСМП
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ОтключитьПоВидуПродукцииВидуОперации - Булево - признак необходимости исключения запросов по настройкам исключений контролей
// 
// Возвращаемое значение:
//  Булево - значение ЗапрашиватьДанныеНеизвестныхУпаковокИСМП
Функция ЗначениеПараметраСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, ОтключитьПоВидуПродукцииВидуОперации = Ложь) Экспорт
	
	Значение = Ложь;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыСканирования, "ЗапрашиватьДанныеНеизвестныхУпаковокИСМП") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП) = Тип("Строка") Тогда
		
		Если ВРег(ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП) = "ПОУМОЛЧАНИЮ" Тогда
			Значение = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЗапрашиватьДанныеСервиса() И Не ОтключитьПоВидуПродукцииВидуОперации;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП) = Тип("Булево") Тогда
		
		Значение = ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Устанавливает значение параметра ЗапрашиватьДанныеНеизвестныхУпаковокИСМП. 
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  Значение - Булево, Строка - если устанавливается строка "ПоУмолчанию", то значение берется в соответствие с ФО ЗапрашиватьДанныеСервисаИСМП
//    если требуется поведение, отличное от ФО, то оно устанавливается напрямую значением типа Булево
Процедура УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Значение = "ПоУмолчанию") Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыСканирования, "ЗапрашиватьДанныеНеизвестныхУпаковокИСМП") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ЗапрашиватьДанныеНеизвестныхУпаковокИСМП = Значение;
	
КонецПроцедуры

// Вид продукции ИС МП требует указание срока годности в операциях нанесения КМ
// 
// Параметры:
//  ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции
//  УчитыватьМолочнуюПродукцию - Булево - Флаг учета молочной продукции
// 
// Возвращаемое значение:
//  Булево - вид продукции требует указания срока годности
Функция ЭтоВидПродукцииСоСрокамиГодности(ВидПродукции, УчитыватьМолочнуюПродукцию = Истина) Экспорт
	
	Если УчитыватьМолочнуюПродукцию И ОбщегоНазначенияИСКлиентСервер.ЭтоМолочнаяПродукцияИСМП(ВидПродукции)
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БАДы")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КреслаКоляски")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ТехническиеСредстваРеабилитации")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МедицинскиеИзделия")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БезалкогольноеПиво")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Пиво")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПивоВПотребительскихУпаковках")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.УпакованнаяВода")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Антисептики")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.СоковаяПродукция")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БезалкогольныеНапитки")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС") Тогда
		Возврат Истина;
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС") Тогда
		Возврат КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КормаДляЖивотныхБезВЕТИС") Тогда
		Возврат КормаДляЖивотныхБезВЕТИСИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МясоПодконтрольноеВЕТИС") Тогда
		Возврат МясоПодконтрольноеВЕТИСИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ВетеринарныеПрепараты") Тогда
		Возврат ВетеринарныеПрепаратыИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ИгрыИИгрушкиДляДетей") Тогда
		Возврат ИгрыИИгрушкиДляДетейИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.РадиоэлектроннаяПродукция") Тогда
		Возврат РадиоэлектроннаяПродукцияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ТитановаяМеталлопродукция") Тогда
		Возврат ТитановаяМеталлопродукцияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КонсервированнаяПродукцияПодконтрольнаяВЕТИС") Тогда
		Возврат КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КонсервированнаяПродукцияБезВЕТИС") Тогда
		Возврат КонсервированнаяПродукцияБезВЕТИСИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.РастительныеМасла") Тогда
		Возврат РастительныеМаслаИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ОптоволокноИОптоволоконнаяПродукция") Тогда
		Возврат ОптоволокноИОптоволоконнаяПродукцияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия") Тогда
		Возврат ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПечатнаяПродукция") Тогда
		Возврат ПечатнаяПродукцияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.СтроительныеМатериалы") Тогда
		Возврат СтроительныеМатериалыИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ОтопительныеПриборы") Тогда
		Возврат ОтопительныеПриборыИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Бакалея") Тогда
		Возврат БакалеяИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.АлкогольнаяПродукцияДо9Процентов") Тогда
		Возврат АлкогольнаяПродукцияДо9ПроцентовИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ТелефоныИНоутбуки") Тогда
		Возврат ТелефоныИНоутбукиИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.ПиротехническиеИзделияИСредстваПожарнойБезопасности") Тогда
		Возврат ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.КабельнаяПродукция") Тогда
		Возврат КабельнаяПродукцияИспользуетСрокГодности();
	ИначеЕсли ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МоторныеМасла") Тогда
		Возврат МоторныеМаслаИспользуетСрокГодности();
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область НовыеТоварныеГруппыВнедрение

#Область ИспользуетСтандартныйКМ

Функция КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция МясоПодконтрольноеВЕТИСИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ВетеринарныеПрепаратыИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ИгрыИИгрушкиДляДетейИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция РадиоэлектроннаяПродукцияИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ТитановаяМеталлопродукцияИспользуетСтандартныйКМ() Экспорт
	Возврат Ложь;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция РастительныеМаслаИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПечатнаяПродукцияИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция СтроительныеМатериалыИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ОтопительныеПриборыИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция БакалеяИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИспользуетСтандартныйКМ() Экспорт
	Возврат Ложь;
КонецФункции

Функция ТелефоныИНоутбукиИспользуетСтандартныйКМ() Экспорт
	Возврат Ложь;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КабельнаяПродукцияИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция МоторныеМаслаИспользуетСтандартныйКМ() Экспорт
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область ИспользуетУкороченныйКМ

Функция КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция МясоПодконтрольноеВЕТИСИспользуетУкороченныйКМ() Экспорт
	Возврат Ложь;
КонецФункции

Функция ВетеринарныеПрепаратыИспользуетУкороченныйКМ() Экспорт
	Возврат Ложь;
КонецФункции

Функция ИгрыИИгрушкиДляДетейИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция РадиоэлектроннаяПродукцияИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ТитановаяМеталлопродукцияИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция РастительныеМаслаИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПечатнаяПродукцияИспользуетУкороченныйКМ() Экспорт
	Возврат Ложь;
КонецФункции

Функция СтроительныеМатериалыИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ОтопительныеПриборыИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция БакалеяИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ТелефоныИНоутбукиИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция КабельнаяПродукцияИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

Функция МоторныеМаслаИспользуетУкороченныйКМ() Экспорт
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область ИспользуетГрупповуюУпаковку

Функция КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция МясоПодконтрольноеВЕТИСИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция ВетеринарныеПрепаратыИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ИгрыИИгрушкиДляДетейИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция РадиоэлектроннаяПродукцияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ТитановаяМеталлопродукцияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция РастительныеМаслаИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ПечатнаяПродукцияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция СтроительныеМатериалыИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция ОтопительныеПриборыИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция БакалеяИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция ТелефоныИНоутбукиИспользуетГрупповуюУпаковку() Экспорт
	Возврат Ложь;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция КабельнаяПродукцияИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

Функция МоторныеМаслаИспользуетГрупповуюУпаковку() Экспорт
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область ИспользуетНабор

Функция КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция МясоПодконтрольноеВЕТИСИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ВетеринарныеПрепаратыИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ИгрыИИгрушкиДляДетейИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция РадиоэлектроннаяПродукцияИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ТитановаяМеталлопродукцияИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция РастительныеМаслаИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ПечатнаяПродукцияИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция СтроительныеМатериалыИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ОтопительныеПриборыИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция БакалеяИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ТелефоныИНоутбукиИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетНабор() Экспорт
	Возврат Истина;
КонецФункции

Функция КабельнаяПродукцияИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

Функция МоторныеМаслаИспользуетНабор() Экспорт
	Возврат Ложь;
КонецФункции

#КонецОбласти

#Область ИспользуетСрокГодности

Функция КормаДляЖивотныхПодконтрольныеВЕТИСИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция МясоПодконтрольноеВЕТИСИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция ВетеринарныеПрепаратыИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция ИгрыИИгрушкиДляДетейИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция РадиоэлектроннаяПродукцияИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция ТитановаяМеталлопродукцияИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция РастительныеМаслаИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция ПечатнаяПродукцияИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция СтроительныеМатериалыИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция ОтопительныеПриборыИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция БакалеяИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция ТелефоныИНоутбукиИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

Функция КабельнаяПродукцияИспользуетСрокГодности()
	Возврат Ложь;
КонецФункции

Функция МоторныеМаслаИспользуетСрокГодности()
	Возврат Истина;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
